Tekla Open API Reference for Tekla Structures 2025
Rotation3D.AxisY Property
Gets the Y direction.
 Namespace: Tekla.Structures.Model.Geometry
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector AxisY { get; }
Public ReadOnly Property AxisY As Vector
	Get
Property Value
Type: Vector
See Also
Reference
Rotation3D Class
Tekla.Structures.Model.Geometry Namespace